results/factorial-final/security-overhead-final-tls-broker5/security-overhead-final-factorial-tls-b5-rf5-isr4-msg10240-tps1000-batch131072-acksall-prod6-complz4-trial3/producer-perf-5.log
producer_index=5
producer_count=6
producer_records=16666
producer_throughput=166
1 records sent, 0.1 records/sec (0.00 MB/sec), 8827.0 ms avg latency, 8827.0 ms max latency.
1302 records sent, 258.8 records/sec (2.53 MB/sec), 3656.6 ms avg latency, 5435.0 ms max latency.
1835 records sent, 365.3 records/sec (3.57 MB/sec), 2372.5 ms avg latency, 5533.0 ms max latency.
831 records sent, 164.6 records/sec (1.61 MB/sec), 24.8 ms avg latency, 107.0 ms max latency.
844 records sent, 168.8 records/sec (1.65 MB/sec), 14.1 ms avg latency, 89.0 ms max latency.
828 records sent, 164.9 records/sec (1.61 MB/sec), 12.4 ms avg latency, 53.0 ms max latency.
839 records sent, 167.5 records/sec (1.64 MB/sec), 12.0 ms avg latency, 58.0 ms max latency.
832 records sent, 166.0 records/sec (1.62 MB/sec), 12.7 ms avg latency, 51.0 ms max latency.
832 records sent, 166.3 records/sec (1.62 MB/sec), 11.3 ms avg latency, 53.0 ms max latency.
832 records sent, 166.2 records/sec (1.62 MB/sec), 12.8 ms avg latency, 87.0 ms max latency.
831 records sent, 166.1 records/sec (1.62 MB/sec), 15.5 ms avg latency, 105.0 ms max latency.
831 records sent, 166.2 records/sec (1.62 MB/sec), 11.3 ms avg latency, 51.0 ms max latency.
832 records sent, 166.2 records/sec (1.62 MB/sec), 10.4 ms avg latency, 52.0 ms max latency.
831 records sent, 165.9 records/sec (1.62 MB/sec), 11.1 ms avg latency, 92.0 ms max latency.
832 records sent, 166.2 records/sec (1.62 MB/sec), 9.4 ms avg latency, 31.0 ms max latency.
831 records sent, 166.2 records/sec (1.62 MB/sec), 9.6 ms avg latency, 49.0 ms max latency.
830 records sent, 165.8 records/sec (1.62 MB/sec), 10.9 ms avg latency, 96.0 ms max latency.
833 records sent, 166.4 records/sec (1.63 MB/sec), 8.4 ms avg latency, 35.0 ms max latency.
831 records sent, 166.0 records/sec (1.62 MB/sec), 7.9 ms avg latency, 24.0 ms max latency.
16666 records sent, 165.956345 records/sec (1.62 MB/sec), 557.23 ms avg latency, 8827.00 ms max latency, 11 ms 50th, 4108 ms 95th, 5068 ms 99th, 5492 ms 99.9th.